#### OrderedViewList Property

---

|  |
| --- |
| InSessionViewSheetSet Class   See Also |

Ordered views.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual IReadOnlyList<View> OrderedViewList { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property OrderedViewList As IReadOnlyList(Of View) 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property IReadOnlyList<View^>^ OrderedViewList { 	IReadOnlyList<View^>^ get (); 	void set (IReadOnlyList<View^>^ value); } ``` |

#### Implements

 IViewSheetSet OrderedViewList

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input ordered view list is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the set operation failed due to invalid view which cannot be printed. |

# See Also

InSessionViewSheetSet Class

Autodesk.Revit.DB Namespace